# Пользователь вводит число. Выведите на экран квадрат этого числа, куб этого числа.

num = int(input("Input plz: "))

print(num ** 2, num ** 3)