# Вывести на экран прямоугольник, заполненный буквами А. 
# Количество строк в прямоугольнике равно 5, количество столбцов равно 8.

str = 'A ' * 8 + '\n'

print(str * 5)

print('''A A A A A A A A 
A A A A A A A A
A A A A A A A A
A A A A A A A A
A A A A A A A A''')