# Вывести на экран пять строк из нулей, 
# причем количество нулей в каждой строке равно номеру строки.

print('0' * 1, '0' * 2, '0' * 3, '0' * 4, '0' * 5, sep='\n')